# Pandas Assignment

In [84]:
import numpy as np
import pandas as pd

1. Write a Pandas program to create and display a one-dimensional array-like object containing an array of data.

In [85]:
arr = pd.array([11, 22, 33, 44, 55])
print(arr)

<IntegerArray>
[11, 22, 33, 44, 55]
Length: 5, dtype: Int64

2. Write a Pandas program to convert a Panda module Series to Python list and itâ€™s type.

In [86]:
s1 = pd.Series([10, 20, 30, 40, 50])
l1 = [s1]
print(s1)
print(f"Type of s1 = {type(s1)}")
print(l1)
print(f"Type of l1 = {type(l1)}")

0    10
1    20
2    30
3    40
4    50
dtype: int64
Type of s1 = <class 'pandas.core.series.Series'>
[0    10
1    20
2    30
3    40
4    50
dtype: int64]
Type of l1 = <class 'list'>

3. Write a Pandas program to add, subtract, multiple and divide two Pandas Series.
   Sample Series: [2, 4, 6, 8, 10], [1, 3, 5, 7, 9]

In [87]:
arr1 = pd.Series([88, 55, 22, 33, 66])
arr2 = pd.Series([77, 44, 11, 22, 33])
print(arr1+arr2)
print(arr1-arr2)
print(arr1*arr2)
print(arr1/arr2)

0    165
1     99
2     33
3     55
4     99
dtype: int64
0    11
1    11
2    11
3    11
4    33
dtype: int64
0    6776
1    2420
2     242
3     726
4    2178
dtype: int64
0    1.142857
1    1.250000
2    2.000000
3    1.500000
4    2.000000
dtype: float64

4. Write a Pandas program to convert a dictionary to a Pandas series.

In [88]:
dict = {"name":"Priyanshu", "course":"DESD", "Batch":"E3"}
print(f"Dictionary: {dict}")
s1 = pd.Series(dict)
print(f"Series: \n{s1}")

Dictionary: {'name': 'Priyanshu', 'course': 'DESD', 'Batch': 'E3'}
Series:
name      Priyanshu
course         DESD
Batch            E3
dtype: object

5. Write a Pandas program to convert a NumPy array to a Pandas series.

In [89]:
arr = np.array([7, 4, 1, 8, 5])
print(f"arr: {arr}")
print(f"Type of arr: {type(arr)}")
s1 = pd.Series(arr)
print(f"s1: {s1}")
print(f"Type of s1: {type(s1)}")

arr: [7 4 1 8 5]
Type of arr: <class 'numpy.ndarray'>
s1: 0    7
1    4
2    1
3    8
4    5
dtype: int64
Type of s1: <class 'pandas.core.series.Series'>

6. Write a Pandas program to change the data type of given a column or a Series.

In [90]:
dict = [{"name":"P1", "age":23, "id": 123}, {"name": "P2", "age":26, "id": 654}, {"name": "P3", "age":20, "id":769}]
print(f"dict: \n{dict}")
print(f"Type of dict: {type(dict)}")

df = pd.DataFrame(dict)
print(f"df: \n{df}")

print(f"Before conversion of Datatype: \n{df.dtypes}")
df = df.astype({"name":'float', "age":'float'}, errors='ignore')
print(f"After conversion of Datatype: \n{df.dtypes}")

print(f"Type of df: {type(df)}")

n = np.array(df)
print(f"Array: \n{n}")
print(type(n))
print(n.dtype)

dict:
[{'name': 'P1', 'age': 23, 'id': 123}, {'name': 'P2', 'age': 26, 'id': 654}, {'name': 'P3', 'age': 20, 'id': 769}]
Type of dict: <class 'list'>
df:
  name  age   id
0   P1   23  123
1   P2   26  654
2   P3   20  769
Before conversion of Datatype:
name    object
age      int64
id       int64
dtype: object
After conversion of Datatype:
name     object
age     float64
id        int64
dtype: object
Type of df: <class 'pandas.core.frame.DataFrame'>
Array:
[['P1' 23.0 123]
 ['P2' 26.0 654]
 ['P3' 20.0 769]]
<class 'numpy.ndarray'>
object

7. Write a Pandas program to convert a given Series to an array.

In [91]:
s1 = pd.Series([1, 2, 3, 4, 5])
print(f"s1: \n{s1}")
print(f"Type of s1: {type(s1)}")
arr = np.array(s1)
print(f"arr: \n{arr}")
print(f"Type of arr: {type(arr)}")

s1:
0    1
1    2
2    3
3    4
4    5
dtype: int64
Type of s1: <class 'pandas.core.series.Series'>
arr:
[1 2 3 4 5]
Type of arr: <class 'numpy.ndarray'>

8. Write a Pandas program to create a dataframe from a dictionary and display it.

In [92]:
dict = [{"name":"P1", "age":23, "id": 123}, {"name": "P2", "age":26, "id": 654}, {"name": "P3", "age":20, "id":769}]
print(f"dict: \n{dict}")
print(f"Type of dict: {type(dict)}")
df = pd.DataFrame(dict)
print(f"df: \n{df}")
print(f"Type of df: {type(df)}")

dict:
[{'name': 'P1', 'age': 23, 'id': 123}, {'name': 'P2', 'age': 26, 'id': 654}, {'name': 'P3', 'age': 20, 'id': 769}]
Type of dict: <class 'list'>
df:
  name  age   id
0   P1   23  123
1   P2   26  654
2   P3   20  769
Type of df: <class 'pandas.core.frame.DataFrame'>

9. i) Create a list of empids and names (10 employees).
   ii) Convert list into Series.
   iii) Print type of Series.
   iv) Convert Series into DataFrame.
   v) a) Display all records.
      b) Display first five records.
      c) Display last five records.
      d) Display first two and last two records.
      e) Display name of 5th employee.
      f) Display record of 4th employee.
   vi) Save the record in csv file (MyRecord.csv)`

In [93]:
# l1 = [[101, "Aakash"], [121, "Aashay"], [137, "Pratham"], [146, "Pritam"], [175, "Nikhil"], [184, "Saurabh"], [218, "Jitendra"], [257, "Kartik"], [305, "Shyam"], [319, "Vinayak"]]
#i) Create a list of empids and names (10 employees). 

l1 = [101, 121, 137, 146, 175, 184, 218, 257, 305, 319]
l2 = ["Aakash", "Aashay", "Pratham", "Pritam", "Nikhil", "Saurabh", "Jitendra", "kartik", "Shyam", "Vinayak"]
print(f"l1 : {l1}")
print(f"Type of l1 = {type(l1)}")
print(f"l2 : {l2}")
print(f"Type of l2 = {type(l2)}")

#ii) Convert list into Series.

s1 = pd.Series(l2, index = l1)
print(f"s1: \n{s1}")

#iii) Print type of Series.

print(f"Type of s1 = {type(s1)}")

#iv) Convert Series into DataFrame.

df = pd.DataFrame(data = s1, columns = ['Name'])
print(f"dataframe: \n{df}")
print(f"Type of df = {type(df)}")

#v) a) Display all records. 

print(f"All records: {df}")

#b) Display first five records. c) Display last five records. d) Display first two and last two records. 

print(f"First five records: \n{df.head()}")
print(f"Last five records: \n{df.tail()}")
print(f"First two records: \n {df.head(2)}")
print(f"Last two records: \n{df.tail(2)}")
print()

#e) Display name of 5th employee.

res = df.iloc[[4], df.columns.isin(['Name'])].values
print(f"Name of 5th employee: \n{res}")

#f) Display record of 4th employee.

res = df.iloc[3]
print(f"\nRecord of 4th employee: \n{res}")

#vi) Save the record in csv file (MyRecord.csv)
df.to_csv('./MyRecord.csv')

df = pd.read_csv('./MyRecord.csv')
df.head()

l1 : [101, 121, 137, 146, 175, 184, 218, 257, 305, 319]
Type of l1 = <class 'list'>
l2 : ['Aakash', 'Aashay', 'Pratham', 'Pritam', 'Nikhil', 'Saurabh', 'Jitendra', 'kartik', 'Shyam', 'Vinayak']
Type of l2 = <class 'list'>
s1:
101      Aakash
121      Aashay
137     Pratham
146      Pritam
175      Nikhil
184     Saurabh
218    Jitendra
257      kartik
305       Shyam
319     Vinayak
dtype: object
Type of s1 = <class 'pandas.core.series.Series'>
dataframe:
         Name
101    Aakash
121    Aashay
137   Pratham
146    Pritam
175    Nikhil
184   Saurabh
218  Jitendra
257    kartik
305     Shyam
319   Vinayak
Type of df = <class 'pandas.core.frame.DataFrame'>
All records:          Name
101    Aakash
121    Aashay
137   Pratham
146    Pritam
175    Nikhil
184   Saurabh
218  Jitendra
257    kartik
305     Shyam
319   Vinayak
First five records:
        Name
101   Aakash
121   Aashay
137  Pratham
146   Pritam
175   Nikhil
Last five records:
         Name
184   Saurabh
218  Jitendra
257    kartik
305     Shyam
319   Vinayak
First two records:
        Name
101  Aakash
121  Aashay
Last two records:
        Name
305    Shyam
319  Vinayak

Name of 5th employee:
[['Nikhil']]

Record of 4th employee:
Name    Pritam
Name: 146, dtype: object

   Unnamed: 0     Name
0         101   Aakash
1         121   Aashay
2         137  Pratham
3         146   Pritam
4         175   Nikhil

10. i) Read the MyRecord.csv file.
    ii) Create a new column Salary.

In [94]:
df = pd.read_csv('./MyRecord.csv')
df['Salary'] = [8, 7, 8, 7, 7, 6, 10, 6, 8, 12]
df.head()

   Unnamed: 0     Name  Salary
0         101   Aakash       8
1         121   Aashay       7
2         137  Pratham       8
3         146   Pritam       7
4         175   Nikhil       7

11. Refer the dataset "Advertising.csv" and perform following tasks.
i) Read the dataset "Advertising.csv" in data frame.

ii) Print first five records of dataset.

iii) print last five records from dataset.

iv) display the columns inside the dataset.

v) display last three records from dataset.

vi) display the information about the dataset and analyse the data.

vii) display types of each columns.
 
viii) check for null values in the dataset and display the sum of null values inside the column.

ix) drop a column 'radio' from a dataset and display first ten records.

x) increase the sales by 10% and add a new column "updated_sales" in dataframe.

xi) display shape of data.

xii) Find out maximum,minimum,mean,median,standard deviation value of each column.
 
xiii) describe the dataset.

In [116]:
df = pd.read_csv('./Advertising.csv')
df.head()

      TV  radio  newspaper  sales
0  230.1   37.8       69.2   22.1
1   44.5   39.3       45.1   10.4
2   17.2   45.9       69.3    9.3
3  151.5   41.3       58.5   18.5
4  180.8   10.8       58.4   12.9

In [117]:
df.tail()

        TV  radio  newspaper  sales
195   38.2    3.7       13.8    7.6
196   94.2    4.9        8.1    9.7
197  177.0    9.3        6.4   12.8
198  283.6   42.0       66.2   25.5
199  232.1    8.6        8.7   13.4

In [118]:
df.columns

Index(['TV', 'radio', 'newspaper', 'sales'], dtype='object')

In [119]:
df.tail(3)

        TV  radio  newspaper  sales
197  177.0    9.3        6.4   12.8
198  283.6   42.0       66.2   25.5
199  232.1    8.6        8.7   13.4

In [120]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   TV         200 non-null    float64
 1   radio      200 non-null    float64
 2   newspaper  200 non-null    float64
 3   sales      200 non-null    float64
dtypes: float64(4)
memory usage: 6.4 KB

In [121]:
df.isna().sum()

TV           0
radio        0
newspaper    0
sales        0
dtype: int64

In [122]:
df = df.drop(['radio'], axis=1) 
df.head(10)

      TV  newspaper  sales
0  230.1       69.2   22.1
1   44.5       45.1   10.4
2   17.2       69.3    9.3
3  151.5       58.5   18.5
4  180.8       58.4   12.9
5    8.7       75.0    7.2
6   57.5       23.5   11.8
7  120.2       11.6   13.2
8    8.6        1.0    4.8
9  199.8       21.2   10.6

In [123]:
df['updated_sales'] = (df['sales'] * 0.10) + df['sales']
print(df)

        TV  newspaper  sales  updated_sales
0    230.1       69.2   22.1          24.31
1     44.5       45.1   10.4          11.44
2     17.2       69.3    9.3          10.23
3    151.5       58.5   18.5          20.35
4    180.8       58.4   12.9          14.19
..     ...        ...    ...            ...
195   38.2       13.8    7.6           8.36
196   94.2        8.1    9.7          10.67
197  177.0        6.4   12.8          14.08
198  283.6       66.2   25.5          28.05
199  232.1        8.7   13.4          14.74

[200 rows x 4 columns]

In [124]:
df.shape

(200, 4)

In [125]:
df.describe()

               TV   newspaper       sales  updated_sales
count  200.000000  200.000000  200.000000     200.000000
mean   147.042500   30.554000   14.022500      15.424750
std     85.854236   21.778621    5.217457       5.739202
min      0.700000    0.300000    1.600000       1.760000
25%     74.375000   12.750000   10.375000      11.412500
50%    149.750000   25.750000   12.900000      14.190000
75%    218.825000   45.100000   17.400000      19.140000
max    296.400000  114.000000   27.000000      29.700000

12. Refer the dataset "Salaries.csv" and perform following tasks.
i) Read the dataset in dataframe.

ii) display first five records.

iii) display first ten records.

iv) display last five records.

v) display last ten records.

vi) display the columns inside the dataset.

vii) display shape of data.

viii) describe the dataset.

ix) display the information about the dataset and analyse the data.

x) display types of each columns.

xi) Find out maximum,minimum,mean,median,standard deviation value of each column.

In [105]:
df = pd.read_csv('./Salary_Data.csv')
df.head()

   YearsExperience  Salary
0              1.1   39343
1              1.3   46205
2              1.5   37731
3              2.0   43525
4              2.2   39891

In [106]:
df.head(10)

   YearsExperience  Salary
0              1.1   39343
1              1.3   46205
2              1.5   37731
3              2.0   43525
4              2.2   39891
5              2.9   56642
6              3.0   60150
7              3.2   54445
8              3.2   64445
9              3.7   57189

In [107]:
df.tail()

    YearsExperience  Salary
28             10.3  122391
29             10.5  121872
30             11.0  140000
31             12.0  155000
32             13.0  156000

In [108]:
df.tail(10)

    YearsExperience  Salary
23              8.2  113812
24              8.7  109431
25              9.0  105582
26              9.5  116969
27              9.6  112635
28             10.3  122391
29             10.5  121872
30             11.0  140000
31             12.0  155000
32             13.0  156000

In [109]:
df.columns

Index(['YearsExperience', 'Salary'], dtype='object')

In [110]:
df.shape

(33, 2)

In [111]:
df.describe()

       YearsExperience         Salary
count        33.000000      33.000000
mean          5.921212   82760.303030
std           3.342413   34014.620992
min           1.100000   37731.000000
25%           3.200000   56957.000000
50%           5.100000   67938.000000
75%           8.700000  109431.000000
max          13.000000  156000.000000

In [112]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 33 entries, 0 to 32
Data columns (total 2 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   YearsExperience  33 non-null     float64
 1   Salary           33 non-null     int64
dtypes: float64(1), int64(1)
memory usage: 656.0 bytes

In [113]:
df.isna().sum()

YearsExperience    0
Salary             0
dtype: int64